---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.ThermalResistance
source: html/ffd530da-8ea9-738a-078f-077d2806144b.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.ThermalResistance Property

The calculated thermal resistance value (R-Value).
 The units are meter-squared kelvin per watt ((m^2*K)/Watt).

## Syntax (C#)
```csharp
public double ThermalResistance { get; }
```